---
kind: property
id: P:Autodesk.Revit.DB.AssemblyMemberDifferentCategory.CategoryId2
source: html/2f687142-fdc9-f422-c904-c7705bec7331.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentCategory.CategoryId2 Property

Category id of the second assembly member

## Syntax (C#)
```csharp
public ElementId CategoryId2 { get; }
```